a52dec
accounts-qml-module
accountsservice
acl
adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adwaita-cursors
adwaita-icon-theme
aha
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
aom
appimagelauncher
appstream
appstream-qt
archlinux-keyring
argon2
ark
at-spi2-core
atkmm
attica
attr
audiocd-kio
audit
autoconf
automake
avahi
b43-fwcutter
baloo
baloo-widgets
base
base-devel
bash
bash-completion
bat
betterdiscordctl
bind
binutils
bison
bluedevil
bluez
bluez-libs
bluez-qt
bluez-utils
boost
boost-libs
breeze
breeze-gtk
breeze-icons
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
cdparanoia
cfitsio
chromaprint
cifs-utils
clang
clinfo
cmake
compiler-rt
confuse
convertlit
coreutils
cpio
cryptsetup
curl
dav1d
db5.3
dbus
dbus-glib
dbus-python
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
dhclient
diffutils
ding-libs
discord
discount
djvulibre
dkms
dmidecode
dmraid
dnsmasq
dnssec-anchors
dolphin
dosfstools
double-conversion
downgrade
dracut
duf
duktape
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efitools
efivar
egl-wayland
eglexternalplatform
ell
enchant
endeavouros-keyring
endeavouros-mirrorlist
endeavouros-theming
eos-apps-info
eos-bash-shared
eos-hooks
eos-log-tool
eos-packagelist
eos-plasma-sddm-config
eos-quickstart
eos-rankmirrors
eos-settings-plasma
eos-translations
eos-update-notifier
ethtool
exa
exfatprogs
exiv2
expac
expat
f2fs-tools
faac
faad2
fakeroot
ffmpeg
ffmpeg4.4
ffmpegthumbnailer
figlet
file
filesystem
findutils
firefox
firewalld
flac
flameshot
flashrom
flex
fluidsynth
fontconfig
frameworkintegration
freeglut
freetype2
fribidi
fsarchiver
fuse-common
fuse2
fuse3
fwupd
fwupd-efi
fzf
gawk
gc
gcab
gcc
gcc-libs
gdbm
gdk-pixbuf2
gettext
ghostscript
giflib
git
glances
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gnupg
gnutls
go
gobject-introspection-runtime
google-chrome
gperf
gperftools
gpgme
gpm
gptfdisk
graphene
graphite
grep
groff
gsettings-desktop-schemas
gsm
gspell
gssdp
gssproxy
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-ugly
gstreamer
gtest
gtk-update-icon-cache
gtk3
gtkmm3
gtksourceview3
gtksourceview4
guile
gupnp
gupnp-igd
gwenview
gzip
harfbuzz
harfbuzz-icu
haveged
hdparm
hicolor-icon-theme
hidapi
highway
http-parser
hwdata
hwdetect
hwinfo
hyphen
iana-etc
icu
ijs
imagemagick
imath
inetutils
iniparser
intel-ucode
inxi
iproute2
iptables-nft
iputils
iso-codes
iwd
jansson
jasper
java-runtime-common
jbig2dec
jemalloc
jfsutils
jre-openjdk
jre-openjdk-headless
json-c
json-glib
jsoncpp
kaccounts-integration
kactivities
kactivities-stats
kactivitymanagerd
karchive
kate
kauth
kbd
kbookmarks
kcalc
kcmutils
kcodecs
kcolorpicker
kcompletion
kconfig
kconfigwidgets
kcontacts
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kde-gtk-config
kdeclarative
kdeconnect
kdecoration
kded
kdelibs4support
kdeplasma-addons
kdesu
kdnssd
kdsoap
kdsoap-ws-discovery-client
kemoticons
kernel-install-for-dracut
keyutils
kfilemetadata
kglobalaccel
kguiaddons
kholidays
khotkeys
ki18n
kiconthemes
kidletime
kimageannotator
kinfocenter
kinit
kio
kio-extras
kio-fuse
kirigami-addons
kirigami2
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kjs
kmenuedit
kmod
knewstuff
knotifications
knotifyconfig
konsole
kpackage
kparts
kpeople
kpeoplevcard
kpipewire
kpty
kquickcharts
krb5
krunner
kscreen
kscreenlocker
kservice
ksystemstats
ktexteditor
ktextwidgets
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwayland
kwidgetsaddons
kwin
kwindowsystem
kxmlgui
l-smash
lame
layer-shell-qt
lcms2
ldb
ldns
less
libaccounts-glib
libaccounts-qt
libaio
libappimage
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libavtp
libb2
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcbor
libcdio
libcloudproviders
libcolord
libcups
libcurl-gnutls
libdaemon
libdatrie
libdbusmenu-qt5
libdc1394
libdca
libde265
libdecor
libdmtx
libdrm
libdv
libdvbpsi
libdvdcss
libdvdnav
libdvdread
libebml
libedit
libelf
libepoxy
libevdev
libevent
libfakekey
libfdk-aac
libffi
libfontenc
libfreeaptx
libftdi
libgcrypt
libgirepository
libgit2
libglvnd
libgme
libgpg-error
libgsf
libgudev
libgusb
libical
libice
libidn
libidn2
libiec61883
libimobiledevice
libinih
libinput
libinstpatch
libisl
libjcat
libjpeg-turbo
libjxl
libkate
libkcddb
libkcompactdisc
libkdcraw
libkexiv2
libksba
libkscreen
libksysguard
liblc3
libldac
libldap
liblqr
liblrdf
libltc
libluv
libmad
libmanette
libmatroska
libmaxminddb
libmbim
libmd
libmfx
libmicrodns
libmm-glib
libmnl
libmodplug
libmpack
libmpc
libmpcdec
libmpeg2
libmtp
libmusicbrainz5
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnice
libnl
libnm
libnotify
libnsl
libogg
libomxil-bellagio
libopenmpt
libopenraw
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqaccessibilityclient
libqalculate
libqmi
libqrtr-glib
libraqm
libraw
libraw1394
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libsidplay
libsigc++
libsm
libsmbios
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libsrtp
libssh
libssh2
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtraceevent
libtracefs
libunistring
libunwind
libupnp
liburcu
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libverto
libvorbis
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwnck3
libwpe
libx11
libx86emu
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
lldb
llvm-libs
lm_sensors
lmdb
logrotate
lolcat
lsb-release
lsscsi
lua
lua51
lua51-lpeg
lua51-mpack
lua52
luajit
luit
lv2
lvm2
lz4
lzo
m4
mailcap
make
man-db
man-pages
md4c
mdadm
media-player-info
meld
mesa
mesa-utils
milou
minizip
mjpegtools
mlocate
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpfr
mpg123
msgpack-c
mtdev
mtools
nano
nano-syntax-highlighting
ncurses
ndctl
neofetch
neon
neovim-nightly
nerd-fonts-complete-starship
net-tools
netctl
nettle
networkmanager
networkmanager-openconnect
networkmanager-openvpn
networkmanager-qt
nfs-utils
nfsidmap
nftables
nilfs-utils
ninja
nodejs
noto-fonts
noto-fonts-emoji
npth
nspr
nss
nss-mdns
ntfs-3g
ntp
nvidia-dkms
nvidia-hook
nvidia-inst
nvidia-installer-common
nvidia-utils
oath-toolkit
ocl-icd
okular
oniguruma
openal
openconnect
opencore-amr
openexr
openjpeg2
openresolv
openssh
openssl
openvpn
opus
orc
oxygen-sounds
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pahole
pam
pambase
pango
pangomm
parallel
parted
patch
patchelf
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
perl-xml-writer
phonon-qt5
phonon-qt5-gstreamer
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
pkgfile
plasma-desktop
plasma-disks
plasma-framework
plasma-integration
plasma-nm
plasma-pa
plasma-workspace
polkit
polkit-kde-agent
polkit-qt5
poppler
poppler-data
poppler-glib
poppler-qt5
popt
portaudio
postman-bin
power-profiles-daemon
powerdevil
ppp
print-manager
prison
procps-ng
protobuf
protobuf-c
psmisc
pulseaudio-qt
purpose
pv
python
python-attrs
python-cairo
python-capng
python-cffi
python-colorama
python-cryptography
python-defusedxml
python-future
python-gobject
python-packaging
python-pip
python-ply
python-psutil
python-pyaml
python-pycparser
python-pyqt5
python-pyqt5-sip
python-shtab
python-six
python-termcolor
python-ujson
python-wheel
python-yaml
qca-qt5
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-location
qt5-multimedia
qt5-quickcontrols
qt5-quickcontrols2
qt5-sensors
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-x11extras
qt6-base
qt6-declarative
qt6-translations
raptor
rav1e
re2
readline
rebuild-detector
reflector
reflector-simple
reiserfsprogs
rhash
ripgrep
rpcbind
rsync
rtkit
rtmpdump
ruby
ruby-abbrev
ruby-base64
ruby-benchmark
ruby-bigdecimal
ruby-bundledgems
ruby-bundler
ruby-cgi
ruby-csv
ruby-date
ruby-delegate
ruby-did_you_mean
ruby-diff-lcs
ruby-digest
ruby-drb
ruby-english
ruby-erb
ruby-etc
ruby-fcntl
ruby-fiddle
ruby-fileutils
ruby-find
ruby-forwardable
ruby-getoptlong
ruby-io-console
ruby-io-nonblock
ruby-io-wait
ruby-ipaddr
ruby-irb
ruby-json
ruby-logger
ruby-manpages
ruby-minitest
ruby-mutex_m
ruby-net-http
ruby-open-uri
ruby-optimist
ruby-paint
ruby-power_assert
ruby-psych
ruby-racc
ruby-rainbow
ruby-rake
ruby-rdoc
ruby-reline
ruby-rexml
ruby-rspec
ruby-rspec-core
ruby-rspec-expectations
ruby-rspec-mocks
ruby-rspec-support
ruby-ruby2_keywords
ruby-stdlib
ruby-stringio
ruby-sync
ruby-term-ansicolor
ruby-test-unit
ruby-time
ruby-tins
ruby-tmpdir
ruby-uri
rubygems
run-parts
rust
rust-analyzer
rust-src
s-nail
sbc
sddm
sddm-kcm
sdl2
sed
sequoia-sqv
serd
sg3_utils
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
sl
slang
smartmontools
smbclient
snappy
socat
sof-firmware
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
spandsp
spectacle
speex
speexdsp
spicetify-cli
spirv-tools
spotify
sqlite
squashfuse
sratom
srt
startup-notification
stoken
sudo
svt-av1
svt-hevc
syndication
syntax-highlighting
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tcl
tdb
tevent
texinfo
thin-provisioning-tools
threadweaver
tinycompress
tldr
tmux
tmux-plugin-manager
tpm2-tss
tracker3
tree-sitter
tslib
ttf-bitstream-vera
ttf-dejavu
ttf-hack
ttf-liberation
ttf-opensans
tzdata
udisks2
unibilium
unrar
unzip
upower
usb_modeswitch
usbmuxd
usbutils
util-linux
util-linux-libs
v4l-utils
vi
vid.stab
vlc
vmaf
volume_key
vpnc
vulkan-headers
vulkan-icd-loader
vulkan-tools
wayland
wayland-protocols
wayland-utils
webkit2gtk
webrtc-audio-processing
welcome
wget
which
wildmidi
wireplumber
woff2
wpa_supplicant
wpebackend-fdo
x264
x265
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xclip
xdg-dbus-proxy
xdg-user-dirs
xdg-utils
xf86-input-libinput
xfsprogs
xkeyboard-config
xl2tpd
xmlsec
xorg-bdftopcf
xorg-font-util
xorg-fonts-encodings
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkill
xorg-xmessage
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorgproto
xsettingsd
xterm
xvidcore
xxhash
xz
yad
yarn
yay
zbar
zenity
zeromq
zimg
zlib
zsh
zsh-completions
zstd
zvbi
zxing-cpp
